Docker/Results/NoFirewall/Fio/results_1.txt
hostname=5813664fe526, be=0, 64-bit, os=Linux, arch=x86-64, fio=fio-3.36, flags=1
<5813664fe526> write-test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
<5813664fe526> ...
<5813664fe526> Starting 4 processes
<5813664fe526> write-test: Laying out IO file (1 file / 1024MiB)
<5813664fe526> 
write-test: (groupid=0, jobs=1): err= 0: pid=299: Tue Dec 10 18:51:27 2024
  read: IOPS=14.4k, BW=56.1MiB/s (58.8MB/s)(16.4GiB/300002msec)
    slat (nsec): min=1798, max=2221.5k, avg=3403.52, stdev=2155.32
    clat (nsec): min=658, max=5819.2k, avg=65630.89, stdev=22705.90
     lat (usec): min=12, max=5825, avg=69.03, stdev=22.90
    clat percentiles (usec):
     |  1.00th=[   45],  5.00th=[   49], 10.00th=[   62], 20.00th=[   63],
     | 30.00th=[   64], 40.00th=[   65], 50.00th=[   65], 60.00th=[   67],
     | 70.00th=[   68], 80.00th=[   70], 90.00th=[   73], 95.00th=[   75],
     | 99.00th=[   91], 99.50th=[  103], 99.90th=[  165], 99.95th=[  204],
     | 99.99th=[  611]
   bw (  KiB/s): min=54000, max=60984, per=25.01%, avg=57417.99, stdev=894.48, samples=599
   iops        : min=13500, max=15246, avg=14354.50, stdev=223.62, samples=599
  lat (nsec)   : 750=0.01%
  lat (usec)   : 4=0.01%, 10=0.01%, 20=0.01%, 50=5.55%, 100=93.88%
  lat (usec)   : 250=0.54%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=2.22%, sys=7.72%, ctx=4309856, majf=0, minf=16
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=4305835,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write-test: (groupid=0, jobs=1): err= 0: pid=300: Tue Dec 10 18:51:27 2024
  read: IOPS=14.3k, BW=56.0MiB/s (58.7MB/s)(16.4GiB/300002msec)
    slat (nsec): min=1795, max=912350, avg=3424.25, stdev=1951.77
    clat (nsec): min=605, max=5884.5k, avg=65660.42, stdev=22533.17
     lat (usec): min=12, max=5894, avg=69.08, stdev=22.71
    clat percentiles (usec):
     |  1.00th=[   45],  5.00th=[   49], 10.00th=[   62], 20.00th=[   63],
     | 30.00th=[   64], 40.00th=[   65], 50.00th=[   65], 60.00th=[   67],
     | 70.00th=[   68], 80.00th=[   70], 90.00th=[   73], 95.00th=[   75],
     | 99.00th=[   91], 99.50th=[  103], 99.90th=[  165], 99.95th=[  202],
     | 99.99th=[  594]
   bw (  KiB/s): min=53328, max=60600, per=24.99%, avg=57364.98, stdev=900.85, samples=599
   iops        : min=13332, max=15150, avg=14341.25, stdev=225.21, samples=599
  lat (nsec)   : 750=0.01%
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=5.43%
  lat (usec)   : 100=94.00%, 250=0.55%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=2.26%, sys=7.75%, ctx=4305975, majf=0, minf=17
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=4301867,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write-test: (groupid=0, jobs=1): err= 0: pid=301: Tue Dec 10 18:51:27 2024
  read: IOPS=14.3k, BW=56.0MiB/s (58.8MB/s)(16.4GiB/300002msec)
    slat (nsec): min=1809, max=3106.8k, avg=3413.43, stdev=2400.22
    clat (nsec): min=721, max=5831.1k, avg=65644.65, stdev=22534.30
     lat (usec): min=12, max=5833, avg=69.06, stdev=22.75
    clat percentiles (usec):
     |  1.00th=[   45],  5.00th=[   49], 10.00th=[   62], 20.00th=[   63],
     | 30.00th=[   64], 40.00th=[   65], 50.00th=[   65], 60.00th=[   67],
     | 70.00th=[   68], 80.00th=[   70], 90.00th=[   73], 95.00th=[   75],
     | 99.00th=[   91], 99.50th=[  103], 99.90th=[  165], 99.95th=[  202],
     | 99.99th=[  594]
   bw (  KiB/s): min=53928, max=60752, per=25.00%, avg=57400.27, stdev=894.93, samples=599
   iops        : min=13482, max=15188, avg=14350.07, stdev=223.73, samples=599
  lat (nsec)   : 750=0.01%, 1000=0.01%
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=5.51%
  lat (usec)   : 100=93.92%, 250=0.54%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=2.20%, sys=7.77%, ctx=4308361, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=4304456,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write-test: (groupid=0, jobs=1): err= 0: pid=302: Tue Dec 10 18:51:27 2024
  read: IOPS=14.3k, BW=56.1MiB/s (58.8MB/s)(16.4GiB/300002msec)
    slat (nsec): min=1804, max=581788, avg=3413.39, stdev=1878.39
    clat (nsec): min=1352, max=5819.4k, avg=65637.69, stdev=22593.63
     lat (usec): min=12, max=5822, avg=69.05, stdev=22.76
    clat percentiles (usec):
     |  1.00th=[   45],  5.00th=[   49], 10.00th=[   62], 20.00th=[   63],
     | 30.00th=[   64], 40.00th=[   65], 50.00th=[   65], 60.00th=[   67],
     | 70.00th=[   68], 80.00th=[   70], 90.00th=[   73], 95.00th=[   75],
     | 99.00th=[   91], 99.50th=[  103], 99.90th=[  167], 99.95th=[  204],
     | 99.99th=[  594]
   bw (  KiB/s): min=54048, max=60992, per=25.01%, avg=57408.31, stdev=861.76, samples=599
   iops        : min=13512, max=15248, avg=14352.08, stdev=215.44, samples=599
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=5.54%
  lat (usec)   : 100=93.90%, 250=0.54%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=2.24%, sys=7.72%, ctx=4309100, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=4305136,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=224MiB/s (235MB/s), 56.0MiB/s-56.1MiB/s (58.7MB/s-58.8MB/s), io=65.7GiB (70.5GB), run=300002-300002msec
All clients: (groupid=0, jobs=4): err= 0: pid=0: Tue Dec 10 18:51:27 2024
  read: IOPS=57.4k, BW=224Mi (235M)(65.7GiB/300002msec)
    slat (nsec): min=1795, max=3106.8k, avg=3413.65, stdev=2106.23
    clat (nsec): min=605, max=5884.5k, avg=65643.41, stdev=22591.88
     lat (usec): min=12, max=5894, avg=69.06, stdev=22.78
   bw (  KiB/s): min=215304, max=243328, per=25.00%, avg=229591.55, stdev=887.58, samples=2396
   iops        : min=53826, max=60832, avg=57397.89, stdev=221.90, samples=2396
  lat (nsec)   : 750=0.01%, 1000=0.01%
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=5.51%
  lat (usec)   : 100=93.93%, 250=0.54%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=2.23%, sys=7.74%, ctx=17233292, majf=0, minf=63
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=17217294,0,0,0 short=0,0,0,0 dropped=0,0,0,0