Docker/Results/NoFirewall/Fio/results_1.txt
hostname=5b2bfbe8f540, be=0, 64-bit, os=Linux, arch=x86-64, fio=fio-3.36, flags=1
<5b2bfbe8f540> write-test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
<5b2bfbe8f540> ...
<5b2bfbe8f540> Starting 4 processes
<5b2bfbe8f540> 
write-test: (groupid=0, jobs=1): err= 0: pid=428: Tue Dec 10 18:09:41 2024
  read: IOPS=12.5k, BW=48.7MiB/s (51.1MB/s)(14.3GiB/300001msec)
    slat (nsec): min=1692, max=233637, avg=2624.14, stdev=1706.16
    clat (usec): min=2, max=6073, avg=77.11, stdev=27.31
     lat (usec): min=11, max=6097, avg=79.74, stdev=27.49
    clat percentiles (usec):
     |  1.00th=[   61],  5.00th=[   63], 10.00th=[   68], 20.00th=[   72],
     | 30.00th=[   73], 40.00th=[   74], 50.00th=[   74], 60.00th=[   75],
     | 70.00th=[   76], 80.00th=[   79], 90.00th=[   86], 95.00th=[  106],
     | 99.00th=[  141], 99.50th=[  147], 99.90th=[  223], 99.95th=[  285],
     | 99.99th=[  693]
   bw (  KiB/s): min=41712, max=51408, per=25.01%, avg=49882.06, stdev=1021.00, samples=599
   iops        : min=10428, max=12852, avg=12470.52, stdev=255.25, samples=599
  lat (usec)   : 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 100=94.46%
  lat (usec)   : 250=5.46%, 500=0.06%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=1.44%, sys=5.18%, ctx=3742425, majf=0, minf=16
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3740732,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write-test: (groupid=0, jobs=1): err= 0: pid=429: Tue Dec 10 18:09:41 2024
  read: IOPS=12.5k, BW=48.7MiB/s (51.0MB/s)(14.3GiB/300001msec)
    slat (nsec): min=1682, max=547105, avg=2629.90, stdev=1771.30
    clat (nsec): min=1934, max=6073.2k, avg=77149.19, stdev=27292.32
     lat (usec): min=11, max=6102, avg=79.78, stdev=27.48
    clat percentiles (usec):
     |  1.00th=[   61],  5.00th=[   63], 10.00th=[   68], 20.00th=[   72],
     | 30.00th=[   73], 40.00th=[   74], 50.00th=[   74], 60.00th=[   75],
     | 70.00th=[   76], 80.00th=[   79], 90.00th=[   86], 95.00th=[  106],
     | 99.00th=[  141], 99.50th=[  147], 99.90th=[  223], 99.95th=[  289],
     | 99.99th=[  725]
   bw (  KiB/s): min=41872, max=51880, per=25.00%, avg=49855.97, stdev=1009.11, samples=599
   iops        : min=10468, max=12970, avg=12464.00, stdev=252.28, samples=599
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=94.43%, 250=5.49%, 500=0.06%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=1.43%, sys=5.20%, ctx=3740378, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3738818,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write-test: (groupid=0, jobs=1): err= 0: pid=430: Tue Dec 10 18:09:41 2024
  read: IOPS=12.5k, BW=48.7MiB/s (51.1MB/s)(14.3GiB/300000msec)
    slat (nsec): min=1672, max=532562, avg=2634.63, stdev=1751.04
    clat (nsec): min=1540, max=6092.7k, avg=77132.37, stdev=27369.42
     lat (usec): min=11, max=6114, avg=79.77, stdev=27.55
    clat percentiles (usec):
     |  1.00th=[   61],  5.00th=[   63], 10.00th=[   68], 20.00th=[   72],
     | 30.00th=[   73], 40.00th=[   74], 50.00th=[   74], 60.00th=[   75],
     | 70.00th=[   76], 80.00th=[   79], 90.00th=[   86], 95.00th=[  106],
     | 99.00th=[  141], 99.50th=[  147], 99.90th=[  221], 99.95th=[  285],
     | 99.99th=[  644]
   bw (  KiB/s): min=41968, max=51752, per=25.00%, avg=49865.84, stdev=997.89, samples=599
   iops        : min=10492, max=12938, avg=12466.46, stdev=249.47, samples=599
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=94.43%, 250=5.48%, 500=0.06%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=1.42%, sys=5.21%, ctx=3741192, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3739523,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write-test: (groupid=0, jobs=1): err= 0: pid=431: Tue Dec 10 18:09:41 2024
  read: IOPS=12.5k, BW=48.7MiB/s (51.0MB/s)(14.3GiB/300000msec)
    slat (nsec): min=1696, max=143184, avg=2633.72, stdev=1702.88
    clat (usec): min=2, max=6105, avg=77.15, stdev=27.28
     lat (usec): min=11, max=6134, avg=79.78, stdev=27.47
    clat percentiles (usec):
     |  1.00th=[   61],  5.00th=[   63], 10.00th=[   68], 20.00th=[   72],
     | 30.00th=[   73], 40.00th=[   74], 50.00th=[   74], 60.00th=[   75],
     | 70.00th=[   76], 80.00th=[   79], 90.00th=[   86], 95.00th=[  106],
     | 99.00th=[  141], 99.50th=[  147], 99.90th=[  221], 99.95th=[  285],
     | 99.99th=[  717]
   bw (  KiB/s): min=41680, max=51648, per=25.00%, avg=49852.89, stdev=1012.15, samples=599
   iops        : min=10420, max=12912, avg=12463.22, stdev=253.04, samples=599
  lat (usec)   : 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 100=94.40%
  lat (usec)   : 250=5.52%, 500=0.06%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=1.45%, sys=5.20%, ctx=3740174, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3738605,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=195MiB/s (204MB/s), 48.7MiB/s-48.7MiB/s (51.0MB/s-51.1MB/s), io=57.1GiB (61.3GB), run=300000-300001msec
All clients: (groupid=0, jobs=4): err= 0: pid=0: Tue Dec 10 18:09:41 2024
  read: IOPS=49.9k, BW=195Mi (204M)(57.1GiB/300001msec)
    slat (nsec): min=1672, max=547105, avg=2630.60, stdev=1733.10
    clat (nsec): min=1540, max=6106.0k, avg=77136.53, stdev=27314.03
     lat (usec): min=11, max=6134, avg=79.77, stdev=27.50
   bw (  KiB/s): min=167232, max=206688, per=25.00%, avg=199456.76, stdev=1009.44, samples=2396
   iops        : min=41808, max=51672, avg=49864.19, stdev=252.36, samples=2396
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=94.43%, 250=5.49%, 500=0.06%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=1.44%, sys=5.20%, ctx=14964169, majf=0, minf=55
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=14957678,0,0,0 short=0,0,0,0 dropped=0,0,0,0